using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace _4._102Task
{
    internal class Program
    {
        static void Main(string[] args)
        {
            // Даны четыре различных вещественных числа.
            // Не используя полный условный оператор, определить:
            // а) наибольшее из них;
            // б) наименьшее из них.

            Console.Write("Введите первое число: ");

            double a = double.Parse(Console.ReadLine());

            Console.Write("Введите второе число: ");

            double b = double.Parse(Console.ReadLine());

            Console.Write("Введите третье число: ");

            double c = double.Parse(Console.ReadLine());


            Console.Write("Введите четвертое число: ");

            double d = double.Parse(Console.ReadLine());

            double min, max;

            if (true)
            {

            }
        }
    }
}
